# 学习场所： 家里
# 写 习 者：刘明阳
# 学习时间：2021/1/27  12:12
#格式化字符串
# '''占位符'''
# name='张三'
# age=20
# print('我叫%s，今年%d岁'%(name,age))
# '''{}'''
# print('我叫{0}，今年{1}岁'.format(name,age))
# '''f-string'''#可视化
# print(f'我叫{name}，今表示保留3位小数年{age}岁')
print('%10d'% 99)#10表示宽度10
print('%.3f'% 3.1415926)#.3
print('%10.3f'%3.1415936)#总宽度为10 小数点后3位
print('hellohello')
print('{0}'.format(3.1415926))
print('{0:.3}'.format(3.1415926))#.3表示一共三位数
print('{0:.3f}'.format(3.1415926))#.3f表示3位小数
print('{0:10.3}'.format(3.1415926))#同时设置宽度和精度，一共10位，3位小数部分



